# Prompt
brew 'pure'

# Binaries
brew 'git'
brew 'coreutils'
brew 'tldr' # man
brew 'bat' # cat
brew 'z'
brew 'nvm'
brew 'btop'
brew 'dust'
brew 'gnupg'
brew 'eza' # modern replacement for ls with better features
brew 'fzf'
brew 'opencc'
brew 'eye-d3'
brew 'yt-dlp'

# Essential Development Tools
brew 'gh' # GitHub CLI
brew 'jq' # JSON processor
brew 'ripgrep' # fast text search
brew 'fd' # simple find replacement
brew 'htop' # better process monitor
brew 'tree' # directory tree viewer

# Zsh
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

# Apps
# cask 'bitwarden' # use app store version for browser touch id support
cask 'brave-browser'
cask 'google-chrome'
cask 'the-unarchiver'
cask 'karabiner-elements'
cask 'iterm2'
cask 'visual-studio-code'
cask 'iina'
cask 'stats'
cask 'itsycal'

# Development Tools
cask 'postman' # API testing

# Fonts
cask 'font-fira-code-nerd-font'
cask 'font-sf-pro'
cask 'font-sf-mono'
cask 'font-sf-compact'
cask 'font-dm-serif-text'
cask 'font-dm-serif-display'
cask 'font-dm-mono'
cask 'font-hack-nerd-font'
